esp-rs/esp-pacs/esp32c6/svd/esp32c6.base.svd
          <register>
            <name>CLR</name>
            <description>Interrupt clear bits of channel 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE</name>
                <description>Set this bit to clear the OUT_DONE_CH_INT interrupt.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUT_EOF</name>
                <description>Set this bit to clear the OUT_EOF_CH_INT interrupt.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUT_DSCR_ERR</name>
                <description>Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUT_TOTAL_EOF</name>
                <description>Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUTFIFO_OVF</name>
                <description>Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>OUTFIFO_UDF</name>
                <description>Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>AHB_TEST</name>
          <description>reserved</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHB_TESTMODE</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_TESTADDR</name>
              <description>reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CONF</name>
          <description>MISC register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AHBM_RST_INTER</name>
              <description>Set this bit then clear this bit to reset the internal ahb FSM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARB_PRI_DIS</name>
              <description>Set this bit to disable priority arbitration function.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>1'h1: Force clock on for register. 1'h0: Support clock only when application writes registers.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x02202250</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>3</dim>
          <dimIncrement>0xC0</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>CH%s</name>
          <description>Cluster CH%s, containing IN_CONF0_CH?, IN_CONF1_CH?, INFIFO_STATUS_CH?, IN_POP_CH?, IN_LINK_CH?, IN_STATE_CH?, IN_SUC_EOF_DES_ADDR_CH?, IN_ERR_EOF_DES_ADDR_CH?, IN_DSCR_CH?, IN_DSCR_BF0_CH?, IN_DSCR_BF1_CH?, IN_PRI_CH?, IN_PERI_SEL_CH?, OUT_CONF0_CH?, OUT_CONF1_CH?, OUTFIFO_STATUS_CH?, OUT_PUSH_CH?, OUT_LINK_CH?, OUT_STATE_CH?, OUT_EOF_DES_ADDR_CH?, OUT_EOF_BFR_DES_ADDR_CH?, OUT_DSCR_CH?, OUT_DSCR_BF0_CH?, OUT_DSCR_BF1_CH?, OUT_PRI_CH?, OUT_PERI_SEL_CH?</description>
          <addressOffset>0x70</addressOffset>
          <register>
            <name>IN_CONF0</name>
            <description>Configure 0 register of Rx channel 0</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_RST</name>
                <description>This bit is used to reset DMA channel 0 Rx FSM and Rx FIFO pointer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_LOOP_TEST</name>
                <description>reserved</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INDSCR_BURST_EN</name>
                <description>Set this bit to 1 to enable INCR burst transfer for Rx channel 0 reading link descriptor when accessing internal SRAM.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DATA_BURST_EN</name>
                <description>Set this bit to 1 to enable INCR burst transfer for Rx channel 0 receiving data when accessing internal SRAM.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MEM_TRANS_EN</name>
                <description>Set this bit 1 to enable automatic transmitting data from memory to memory via DMA.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_ETM_EN</name>
                <description>Set this bit to 1 to enable etm control mode, dma Rx channel 0 is triggered by etm task.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_CONF1</name>
            <description>Configure 1 register of Rx channel 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_CHECK_OWNER</name>
                <description>Set this bit to enable checking the owner attribute of the link descriptor.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INFIFO_STATUS</name>
            <description>Receive FIFO status of Rx channel 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x07800003</resetValue>
            <fields>
              <field>
                <name>INFIFO_FULL</name>
                <description>L1 Rx FIFO full signal for Rx channel 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_EMPTY</name>
                <description>L1 Rx FIFO empty signal for Rx channel 0.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_CNT</name>
                <description>The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_1B</name>
                <description>reserved</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_2B</name>
                <description>reserved</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_3B</name>
                <description>reserved</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_REMAIN_UNDER_4B</name>
                <description>reserved</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_BUF_HUNGRY</name>
                <description>reserved</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_POP</name>
            <description>Pop control register of Rx channel 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000800</resetValue>
            <fields>
              <field>
                <name>INFIFO_RDATA</name>
                <description>This register stores the data popping from DMA FIFO.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_POP</name>
                <description>Set this bit to pop data from DMA FIFO.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_LINK</name>
            <description>Link descriptor configure and control register of Rx channel 0</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <resetValue>0x01100000</resetValue>
            <fields>
              <field>
                <name>INLINK_ADDR</name>
                <description>This register stores the 20 least significant bits of the first inlink descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINK_AUTO_RET</name>
                <description>Set this bit to return to current inlink descriptor's address when there are some errors in current receiving data.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INLINK_STOP</name>
                <description>Set this bit to stop dealing with the inlink descriptors.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>INLINK_START</name>
                <description>Set this bit to start dealing with the inlink descriptors.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>INLINK_RESTART</name>
                <description>Set this bit to mount a new inlink descriptor.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>INLINK_PARK</name>
                <description>1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_STATE</name>
            <description>Receive status of Rx channel 0</description>
            <addressOffset>0x14</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_ADDR</name>
                <description>This register stores the current inlink descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_DSCR_STATE</name>
                <description>reserved</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_STATE</name>
                <description>reserved</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_SUC_EOF_DES_ADDR</name>
            <description>Inlink descriptor address when EOF occurs of Rx channel 0</description>
            <addressOffset>0x18</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_SUC_EOF_DES_ADDR</name>
                <description>This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_ERR_EOF_DES_ADDR</name>
            <description>Inlink descriptor address when errors occur of Rx channel 0</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_ERR_EOF_DES_ADDR</name>
                <description>This register stores the address of the inlink descriptor when there are some errors in current receiving data. Only used when peripheral is UHCI0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR</name>
            <description>Current inlink descriptor address of Rx channel 0</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR</name>
                <description>The address of the current inlink descriptor x.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR_BF0</name>
            <description>The last inlink descriptor address of Rx channel 0</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_BF0</name>
                <description>The address of the last inlink descriptor x-1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DSCR_BF1</name>
            <description>The second-to-last inlink descriptor address of Rx channel 0</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>INLINK_DSCR_BF1</name>
                <description>The address of the second-to-last inlink descriptor x-2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_PRI</name>
            <description>Priority register of Rx channel 0</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>RX_PRI</name>
                <description>The priority of Rx channel 0. The larger of the value the higher of the priority.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_PERI_SEL</name>
            <description>Peripheral selection of Rx channel 0</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000003F</resetValue>
            <fields>
              <field>
                <name>PERI_IN_SEL</name>
                <description>This register is used to select peripheral for Rx channel 0. 0:SPI2. 1: Dummy. 2: UHCI0. 3: I2S0. 4: Dummy. 5: Dummy. 6: AES. 7: SHA. 8: ADC_DAC. 9: Parallel_IO. 10~15: Dummy</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_CONF0</name>
            <description>Configure 0 register of Tx channel 1</description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000008</resetValue>
            <fields>
              <field>
                <name>OUT_RST</name>
                <description>This bit is used to reset DMA channel 1 Tx FSM and Tx FIFO pointer.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_LOOP_TEST</name>
                <description>reserved</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_AUTO_WRBACK</name>
                <description>Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EOF_MODE</name>
                <description>EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 1 is generated when data need to transmit has been popped from FIFO in DMA</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTDSCR_BURST_EN</name>
                <description>Set this bit to 1 to enable INCR burst transfer for Tx channel 1 reading link descriptor when accessing internal SRAM.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DATA_BURST_EN</name>
                <description>Set this bit to 1 to enable INCR burst transfer for Tx channel 1 transmitting data when accessing internal SRAM.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_ETM_EN</name>
                <description>Set this bit to 1 to enable etm control mode, dma Tx channel 1 is triggered by etm task.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_CONF1</name>
            <description>Configure 1 register of Tx channel 0</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_CHECK_OWNER</name>
                <description>Set this bit to enable checking the owner attribute of the link descriptor.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
