esp-rs/esp-pacs/esp32c6/svd/esp32c6.base.svd
          <register>
            <name>OUTFIFO_STATUS</name>
            <description>Transmit FIFO status of Tx channel 0</description>
            <addressOffset>0x68</addressOffset>
            <size>0x20</size>
            <resetValue>0x07800002</resetValue>
            <fields>
              <field>
                <name>OUTFIFO_FULL</name>
                <description>L1 Tx FIFO full signal for Tx channel 0.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_EMPTY</name>
                <description>L1 Tx FIFO empty signal for Tx channel 0.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_CNT</name>
                <description>The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_1B</name>
                <description>reserved</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_2B</name>
                <description>reserved</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_3B</name>
                <description>reserved</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_4B</name>
                <description>reserved</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PUSH</name>
            <description>Push control register of Rx channel 0</description>
            <addressOffset>0x6C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTFIFO_WDATA</name>
                <description>This register stores the data that need to be pushed into DMA FIFO.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_PUSH</name>
                <description>Set this bit to push data into DMA FIFO.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_LINK</name>
            <description>Link descriptor configure and control register of Tx channel 0</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <resetValue>0x00800000</resetValue>
            <fields>
              <field>
                <name>OUTLINK_ADDR</name>
                <description>This register stores the 20 least significant bits of the first outlink descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTLINK_STOP</name>
                <description>Set this bit to stop dealing with the outlink descriptors.</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_START</name>
                <description>Set this bit to start dealing with the outlink descriptors.</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_RESTART</name>
                <description>Set this bit to restart a new outlink from the last address.</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_PARK</name>
                <description>1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_STATE</name>
            <description>Transmit status of Tx channel 0</description>
            <addressOffset>0x74</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_ADDR</name>
                <description>This register stores the current outlink descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_DSCR_STATE</name>
                <description>reserved</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_STATE</name>
                <description>reserved</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_EOF_DES_ADDR</name>
            <description>Outlink descriptor address when EOF occurs of Tx channel 0</description>
            <addressOffset>0x78</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_EOF_DES_ADDR</name>
                <description>This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_EOF_BFR_DES_ADDR</name>
            <description>The last outlink descriptor address when EOF occurs of Tx channel 0</description>
            <addressOffset>0x7C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_EOF_BFR_DES_ADDR</name>
                <description>This register stores the address of the outlink descriptor before the last outlink descriptor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR</name>
            <description>Current inlink descriptor address of Tx channel 0</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR</name>
                <description>The address of the current outlink descriptor y.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR_BF0</name>
            <description>The last inlink descriptor address of Tx channel 0</description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_BF0</name>
                <description>The address of the last outlink descriptor y-1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR_BF1</name>
            <description>The second-to-last inlink descriptor address of Tx channel 0</description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_BF1</name>
                <description>The address of the second-to-last inlink descriptor x-2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PRI</name>
            <description>Priority register of Tx channel 0.</description>
            <addressOffset>0x8C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_PRI</name>
                <description>The priority of Tx channel 0. The larger of the value the higher of the priority.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PERI_SEL</name>
            <description>Peripheral selection of Tx channel 0</description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000003F</resetValue>
            <fields>
              <field>
                <name>PERI_OUT_SEL</name>
                <description>This register is used to select peripheral for Tx channel 0. 0:SPI2. 1: Dummy. 2: UHCI0. 3: I2S0. 4: Dummy. 5: Dummy. 6: AES. 7: SHA. 8: ADC_DAC. 9: Parallel_IO. 10~15: Dummy</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
