esp-rs/esp-pacs/esp32c6/svd/esp32c6.base.svd
        <register>
          <name>SDIO_SLAVE_ECO_CONF</name>
          <description>sdio_slave redundant control registers</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDIO_SLAVE_RDN_RESULT</name>
              <description>redundant registers for sdio_slave</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDIO_SLAVE_RDN_ENA</name>
              <description>redundant registers for sdio_slave</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_SLAVE_SDIO_CLK_RDN_RESULT</name>
              <description>redundant registers for sdio_slave</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDIO_SLAVE_SDIO_CLK_RDN_ENA</name>
              <description>redundant registers for sdio_slave</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_SLAVE_SDCLK_PAD_RDN_RESULT</name>
              <description>redundant registers for sdio_slave</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDIO_SLAVE_SDCLK_PAD_RDN_ENA</name>
              <description>redundant registers for sdio_slave</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_SLAVE_LDO_CONF</name>
          <description>sdio slave ldo control register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000014</resetValue>
          <fields>
            <field>
              <name>LDO_READY_CTL_IN_EN</name>
              <description>control ldo ready signal by sdio slave itself</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_READY_THRES</name>
              <description>configure ldo ready counting threshold value, the actual counting target is 2^(ldo_ready_thres)-1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_READY_IGNORE_EN</name>
              <description>ignore ldo ready signal</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_DATE</name>
          <description>******* Description ***********</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02203150</resetValue>
          <fields>
            <field>
              <name>SDIO_DATE</name>
              <description>sdio version date.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HMAC</name>
      <description>HMAC (Hash-based Message Authentication Code) Accelerator</description>
      <groupName>HMAC</groupName>
      <baseAddress>0x6008D000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SET_START</name>
          <description>Process control register 0.</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_START</name>
              <description>Start hmac operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_PARA_PURPOSE</name>
          <description>Configure purpose.</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PURPOSE_SET</name>
              <description>Set hmac parameter purpose.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_PARA_KEY</name>
          <description>Configure key.</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY_SET</name>
              <description>Set hmac parameter key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_PARA_FINISH</name>
          <description>Finish initial configuration.</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_PARA_END</name>
              <description>Finish hmac configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_MESSAGE_ONE</name>
          <description>Process control register 1.</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_TEXT_ONE</name>
              <description>Call SHA to calculate one message block.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_MESSAGE_ING</name>
          <description>Process control register 2.</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_TEXT_ING</name>
              <description>Continue typical hmac.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_MESSAGE_END</name>
          <description>Process control register 3.</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_TEXT_END</name>
              <description>Start hardware padding.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_RESULT_FINISH</name>
          <description>Process control register 4.</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_RESULT_END</name>
              <description>After read result from upstream, then let hmac back to idle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_INVALIDATE_JTAG</name>
          <description>Invalidate register 0.</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_INVALIDATE_JTAG</name>
              <description>Clear result from hmac downstream JTAG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SET_INVALIDATE_DS</name>
          <description>Invalidate register 1.</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_INVALIDATE_DS</name>
              <description>Clear result from hmac downstream DS.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_ERROR</name>
          <description>Error register.</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>QUERY_CHECK</name>
              <description>Hmac configuration state. 0: key are agree with purpose. 1: error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUERY_BUSY</name>
          <description>Busy register.</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUSY_STATE</name>
              <description>Hmac state. 1'b0: idle. 1'b1: busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>WR_MESSAGE_MEM[%s]</name>
          <description>Message block memory.</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RD_RESULT_MEM[%s]</name>
          <description>Result from upstream.</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SET_MESSAGE_PAD</name>
          <description>Process control register 5.</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_TEXT_PAD</name>
              <description>Start software padding.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ONE_BLOCK</name>
          <description>Process control register 6.</description>
          <addressOffset>0xF4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SET_ONE_BLOCK</name>
              <description>Don't have to do padding.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOFT_JTAG_CTRL</name>
          <description>Jtag register 0.</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SOFT_JTAG_CTRL</name>
              <description>Turn on JTAG verification.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_JTAG</name>
          <description>Jtag register 1.</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WR_JTAG</name>
              <description>32-bit of key to be compared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Date register.</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x20200618</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Hmac date information/ hmac version information.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
