esp-rs/esp-pacs/esp32c6/svd/esp32c6.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LEDC</name>
      <description>LED Control PWM (Pulse Width Modulation)</description>
      <groupName>LEDC</groupName>
      <baseAddress>0x60007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x154</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LEDC</name>
        <value>45</value>
      </interrupt>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x14</dimIncrement>
          <dimIndex>0-5</dimIndex>
          <name>CH%s</name>
          <description>Cluster CH%s, containing CH?_CONF0, CH?_HPOINT, CH?_DUTY, CH?_CONF1, CH?_DUTY_R</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>CONF0</name>
            <description>Configuration register 0 for channel 0</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIMER_SEL</name>
                <description>This field is used to select one of timers for channel %s.

0: select timer0, 1: select timer1, 2: select timer2, 3: select timer3</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SIG_OUT_EN</name>
                <description>Set this bit to enable signal output on channel %s.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IDLE_LV</name>
                <description>This bit is used to control the output value when channel %s is inactive (when LEDC_SIG_OUT_EN_CH%s is 0).</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PARA_UP</name>
                <description>This bit is used to update LEDC_HPOINT_CH%s, LEDC_DUTY_START_CH%s, LEDC_SIG_OUT_EN_CH%s, LEDC_TIMER_SEL_CH%s, LEDC_DUTY_NUM_CH%s, LEDC_DUTY_CYCLE_CH%s, LEDC_DUTY_SCALE_CH%s, LEDC_DUTY_INC_CH%s, and LEDC_OVF_CNT_EN_CH%s fields for channel %s, and will be automatically cleared by hardware.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OVF_NUM</name>
                <description>This register is used to configure the maximum times of overflow minus 1.

The LEDC_OVF_CNT_CH%s_INT interrupt will be triggered when channel %s overflows for (LEDC_OVF_NUM_CH%s + 1) times.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>10</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVF_CNT_EN</name>
                <description>This bit is used to enable the ovf_cnt of channel %s.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OVF_CNT_RESET</name>
                <description>Set this bit to reset the ovf_cnt of channel %s.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HPOINT</name>
            <description>High point register for channel 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>HPOINT</name>
                <description>The output value changes to high when the selected timers has reached the value specified by this register.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DUTY</name>
            <description>Initial duty cycle for channel 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DUTY</name>
                <description>This register is used to change the output duty by controlling the Lpoint.

The output value turns to low when the selected timers has reached the Lpoint.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONF1</name>
            <description>Configuration register 1 for channel 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DUTY_START</name>
                <description>Other configured fields in LEDC_CH%s_CONF1_REG will start to take effect when this bit is set to 1.</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DUTY_R</name>
            <description>Current duty cycle for channel 0</description>
            <addressOffset>0x10</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DUTY_R</name>
                <description>This register stores the current duty of output signal on channel %s.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>25</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TIMER%s</name>
          <description>Cluster TIMER%s, containing TIMER?_CONF, TIMER?_VALUE</description>
          <addressOffset>0xA0</addressOffset>
          <register>
            <name>CONF</name>
            <description>Timer 0 configuration</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x01000000</resetValue>
            <fields>
              <field>
                <name>DUTY_RES</name>
                <description>This register is used to control the range of the counter in timer %s.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CLK_DIV</name>
                <description>This register is used to configure the divisor for the divider in timer %s.

The least significant eight bits represent the fractional part.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PAUSE</name>
                <description>This bit is used to suspend the counter in timer %s.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RST</name>
                <description>This bit is used to reset timer %s. The counter will show 0 after reset.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TICK_SEL</name>
                <description>This bit is used to select clock for timer %s. When this bit is set to 1 LEDC_APB_CLK_SEL[1:0] should be 1, otherwise the timer clock may be not accurate.

1'h0: SLOW_CLK 1'h1: REF_TICK</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>PARA_UP</name>
                <description>Set this bit to update LEDC_CLK_DIV_TIMER%s and LEDC_TIMER%s_DUTY_RES.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>VALUE</name>
            <description>Timer 0 current counter value</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNT</name>
                <description>This register stores the current counter value of timer %s.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>20</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>Triggered when the timer%s has reached its maximum counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>Interrupt raw bit for channel %s. Triggered when the gradual change of duty has finished.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>Interrupt raw bit for channel %s. Triggered when the OVF_CNT has reached the value specified by LEDC.CHx.CONF0.OVF_NUM.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>This is the masked interrupt status bit for the TIMER%s_OVF interrupt when LEDC.INT_ENA.TIMERx_OVF is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>This is the masked interrupt status bit for the DUTY_CHNG_END_CH%s interrupt when LEDC.INT_ENA.DUTY_CHNG_END_CHx is set to 1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>This is the masked interrupt status bit for the LEDC.INT_RAW.OVF_CNT_CH%s interrupt when LEDC.INT_ENA.OVF_CNT_CHx is set to 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>The interrupt enable bit for the TIMER%s_OVF interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>The interrupt enable bit for the DUTY_CHNG_END_CH%s interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>The interrupt enable bit for the OVF_CNT_CH%s interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>TIMER%s_OVF</name>
              <description>Set this bit to clear the TIMER%s_OVF interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>DUTY_CHNG_END_CH%s</name>
              <description>Set this bit to clear the DUTY_CHNG_END_CH%s interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <dim>6</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-5</dimIndex>
              <name>OVF_CNT_CH%s</name>
              <description>Set this bit to clear the OVF_CNT_CH%s interrupt.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CH%s_GAMMA_WR</name>
          <description>Ledc ch%s gamma ram write register.</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH_GAMMA_DUTY_INC</name>
              <description>Ledc ch%s gamma duty inc of current ram write address.This register is used to increase or decrease the duty of output signal on channel %s. 

1: Increase  0: Decrease.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_GAMMA_DUTY_CYCLE</name>
              <description>Ledc ch%s gamma duty cycle of current ram write address.The duty will change every LEDC_CH%s_GAMMA_DUTY_CYCLE on channel %s.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_GAMMA_SCALE</name>
              <description>Ledc ch%s gamma scale of current ram write address.This register is used to configure the changing step scale of duty on channel %s.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_GAMMA_DUTY_NUM</name>
              <description>Ledc ch%s gamma duty num of current ram write address.This register is used to control the number of times the duty cycle will be changed.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CH%s_GAMMA_WR_ADDR</name>
          <description>Ledc ch%s gamma ram write address register.</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH_GAMMA_WR_ADDR</name>
              <description>Ledc ch%s gamma ram write address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CH%s_GAMMA_RD_ADDR</name>
          <description>Ledc ch%s gamma ram read address register.</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH_GAMMA_RD_ADDR</name>
              <description>Ledc ch%s gamma ram read address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CH%s_GAMMA_RD_DATA</name>
          <description>Ledc ch%s gamma ram read data register.</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH_GAMMA_RD_DATA</name>
              <description>Ledc ch%s gamma ram read data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%s_GAMMA_CONF</name>
          <description>Ledc ch%s gamma config register.</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CH_GAMMA_ENTRY_NUM</name>
              <description>Ledc ch%s gamma entry num.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH_GAMMA_PAUSE</name>
              <description>Ledc ch%s gamma pause, write 1 to pause.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH_GAMMA_RESUME</name>
              <description>Ledc ch%s gamma resume, write 1 to resume.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
