esp-rs/esp-pacs/esp32c6/svd/esp32c6.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_APM</name>
      <description>Low-power Access Permission Management Controller</description>
      <groupName>LP_APM</groupName>
      <baseAddress>0x600B3800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LP_APM_M0</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>LP_APM_M1</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LP_APM0</name>
        <value>39</value>
      </interrupt>
      <registers>
        <register>
          <name>REGION_FILTER_EN</name>
          <description>Region filter enable register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>REGION_FILTER_EN</name>
              <description>Region filter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0xC</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>REGION%s</name>
          <description>Cluster REGION%s, containing REGION*_ADDR_START, REGION*_ADDR_END, REGION*_PMS_ATTR</description>
          <addressOffset>0x4</addressOffset>
          <register>
            <name>ADDR_START</name>
            <description>Region address register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDR_START</name>
                <description>Start address of region0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDR_END</name>
            <description>Region address register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ADDR_END</name>
                <description>End address of region0</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PMS_ATTR</name>
            <description>Region access authority attribute register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <dim>3</dim>
                <dimIncrement>0x4</dimIncrement>
                <dimIndex>0-2</dimIndex>
                <name>R%s_PMS_X</name>
                <description>Region execute authority in REE_MODE%s</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <dim>3</dim>
                <dimIncrement>0x4</dimIncrement>
                <dimIndex>0-2</dimIndex>
                <name>R%s_PMS_W</name>
                <description>Region write authority in REE_MODE%s</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <dim>3</dim>
                <dimIncrement>0x4</dimIncrement>
                <dimIndex>0-2</dimIndex>
                <name>R%s_PMS_R</name>
                <description>Region read authority in REE_MODE%s</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FUNC_CTRL</name>
          <description>PMS function control register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-1</dimIndex>
              <name>M%s_PMS_FUNC_EN</name>
              <description>PMS M%s function enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>M%s</name>
          <description>Cluster M%s, containing M?_STATUS, M?_STATUS_CLR, M?_EXCEPTION_INFO0, M?_EXCEPTION_INFO1</description>
          <addressOffset>0xC8</addressOffset>
          <register>
            <name>STATUS</name>
            <description>M0 status register</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_STATUS</name>
                <description>Exception status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS_CLR</name>
            <description>M0 status clear register</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>REGION_STATUS_CLR</name>
                <description>Clear exception status</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXCEPTION_INFO0</name>
            <description>M0 exception_info0 register</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_REGION</name>
                <description>Exception region</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXCEPTION_MODE</name>
                <description>Exception mode</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>EXCEPTION_ID</name>
                <description>Exception id information</description>
                <bitOffset>18</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EXCEPTION_INFO1</name>
            <description>M0 exception_info1 register</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>EXCEPTION_ADDR</name>
                <description>Exception addr</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INT_EN</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>2</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-1</dimIndex>
              <name>M%s_APM</name>
              <description>APM M%s interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>clock gating register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>reg_clk_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x02205240</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>reg_date</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
