esp-rs/esp-pacs/esp32c6/svd/esp32c6.base.svd
        <register>
          <name>CAP_STATUS</name>
          <description>Edge of last capture trigger</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CAP0_EDGE</name>
              <description>Edge of last capture trigger on channel 0, 0: posedge, 1: negedge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP1_EDGE</name>
              <description>Edge of last capture trigger on channel 1, 0: posedge, 1: negedge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAP2_EDGE</name>
              <description>Edge of last capture trigger on channel 2, 0: posedge, 1: negedge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPDATE_CFG</name>
          <description>Enable update.</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000055</resetValue>
          <fields>
            <field>
              <name>GLOBAL_UP_EN</name>
              <description>The global enable of update of all active registers in MCPWM module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GLOBAL_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of all active registers in MCPWM module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP0_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 0 are enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP0_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP1_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 1 are enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP1_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_UP_EN</name>
              <description>When set and PWM_GLOBAL_UP_EN is set, update of active registers in PWM operator 2 are enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OP2_FORCE_UP</name>
              <description>a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER0_STOP</name>
              <description>The enable bit for the interrupt triggered when the timer 0 stops.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_STOP</name>
              <description>The enable bit for the interrupt triggered when the timer 1 stops.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_STOP</name>
              <description>The enable bit for the interrupt triggered when the timer 2 stops.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEZ</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 0 TEZ event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEZ</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 1 TEZ event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEZ</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 2 TEZ event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEP</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 0 TEP event.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEP</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 1 TEP event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEP</name>
              <description>The enable bit for the interrupt triggered by a PWM timer 2 TEP event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0</name>
              <description>The enable bit for the interrupt triggered when event_f0 starts.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>The enable bit for the interrupt triggered when event_f1 starts.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2</name>
              <description>The enable bit for the interrupt triggered when event_f2 starts.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0_CLR</name>
              <description>The enable bit for the interrupt triggered when event_f0 ends.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1_CLR</name>
              <description>The enable bit for the interrupt triggered when event_f1 ends.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2_CLR</name>
              <description>The enable bit for the interrupt triggered when event_f2 ends.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 0 TEA event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 1 TEA event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEA</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 2 TEA event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEB</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 0 TEB event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEB</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 1 TEB event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEB</name>
              <description>The enable bit for the interrupt triggered by a PWM operator 2 TEB event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_CBC</name>
              <description>The enable bit for the interrupt triggered by a cycle-by-cycle mode action on PWM0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_CBC</name>
              <description>The enable bit for the interrupt triggered by a cycle-by-cycle mode action on PWM1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_CBC</name>
              <description>The enable bit for the interrupt triggered by a cycle-by-cycle mode action on PWM2.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_OST</name>
              <description>The enable bit for the interrupt triggered by a one-shot mode action on PWM0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_OST</name>
              <description>The enable bit for the interrupt triggered by a one-shot mode action on PWM1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_OST</name>
              <description>The enable bit for the interrupt triggered by a one-shot mode action on PWM2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0</name>
              <description>The enable bit for the interrupt triggered by capture on channel 0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1</name>
              <description>The enable bit for the interrupt triggered by capture on channel 1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2</name>
              <description>The enable bit for the interrupt triggered by capture on channel 2.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER0_STOP</name>
              <description>The raw status bit for the interrupt triggered when the timer 0 stops.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_STOP</name>
              <description>The raw status bit for the interrupt triggered when the timer 1 stops.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_STOP</name>
              <description>The raw status bit for the interrupt triggered when the timer 2 stops.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEZ</name>
              <description>The raw status bit for the interrupt triggered by a PWM timer 0 TEZ event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEZ</name>
              <description>The raw status bit for the interrupt triggered by a PWM timer 1 TEZ event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEZ</name>
              <description>The raw status bit for the interrupt triggered by a PWM timer 2 TEZ event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_TEP</name>
              <description>The raw status bit for the interrupt triggered by a PWM timer 0 TEP event.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_TEP</name>
              <description>The raw status bit for the interrupt triggered by a PWM timer 1 TEP event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_TEP</name>
              <description>The raw status bit for the interrupt triggered by a PWM timer 2 TEP event.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0</name>
              <description>The raw status bit for the interrupt triggered when event_f0 starts.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1</name>
              <description>The raw status bit for the interrupt triggered when event_f1 starts.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2</name>
              <description>The raw status bit for the interrupt triggered when event_f2 starts.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT0_CLR</name>
              <description>The raw status bit for the interrupt triggered when event_f0 ends.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT1_CLR</name>
              <description>The raw status bit for the interrupt triggered when event_f1 ends.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAULT2_CLR</name>
              <description>The raw status bit for the interrupt triggered when event_f2 ends.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEA</name>
              <description>The raw status bit for the interrupt triggered by a PWM operator 0 TEA event</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEA</name>
              <description>The raw status bit for the interrupt triggered by a PWM operator 1 TEA event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEA</name>
              <description>The raw status bit for the interrupt triggered by a PWM operator 2 TEA event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR0_TEB</name>
              <description>The raw status bit for the interrupt triggered by a PWM operator 0 TEB event</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR1_TEB</name>
              <description>The raw status bit for the interrupt triggered by a PWM operator 1 TEB event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMPR2_TEB</name>
              <description>The raw status bit for the interrupt triggered by a PWM operator 2 TEB event</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_CBC</name>
              <description>The raw status bit for the interrupt triggered by a cycle-by-cycle mode action on PWM0.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_CBC</name>
              <description>The raw status bit for the interrupt triggered by a cycle-by-cycle mode action on PWM1.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_CBC</name>
              <description>The raw status bit for the interrupt triggered by a cycle-by-cycle mode action on PWM2.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ0_OST</name>
              <description>The raw status bit for the interrupt triggered by a one-shot mode action on PWM0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ1_OST</name>
              <description>The raw status bit for the interrupt triggered by a one-shot mode action on PWM1.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TZ2_OST</name>
              <description>The raw status bit for the interrupt triggered by a one-shot mode action on PWM2.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP0</name>
              <description>The raw status bit for the interrupt triggered by capture on channel 0.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP1</name>
              <description>The raw status bit for the interrupt triggered by capture on channel 1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAP2</name>
              <description>The raw status bit for the interrupt triggered by capture on channel 2.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
